fe40/tutorials/rheoFoam/CrossSlot/Oldroyd-BRootk/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
    grad(p)         Gauss linear;
    grad(U)         Gauss linear;
    linExtrapGrad       Gauss linear;

}

divSchemes
{
    default                  none;
    div(tau)                 Gauss linear; 
    div(grad(U))             Gauss linear;
    div(phi,U)               GaussDefCmpw none; 
    div(phi,C)               GaussDefCmpw cubista;  
    div(phi,theta)            GaussDefCmpw cubista;
    div(phi,tau)             GaussDefCmpw cubista;             
}

laplacianSchemes
{
    default                       none;
    laplacian(eta,U)              Gauss linear orthogonal;
    laplacian(p|(ap-H1))          Gauss linear orthogonal; 
    laplacian(D,C)                Gauss linear orthogonal;
}

interpolationSchemes
{
    default           linear;     
}

snGradSchemes
{
    default         orthogonal;
}

fluxRequired
{
    default         no;
    p;
}

// ************************************************************************* //
